Revit 2024 API
StructuralSectionGeneralShape Enumeration
 General shapes for structural sections.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Since: 2018
Syntax
C#
public enum StructuralSectionGeneralShape
Visual Basic
Public Enumeration StructuralSectionGeneralShape
Visual C++
public enum class StructuralSectionGeneralShape
Members
Member name | Description
NotDefined |  General shape is not defined.
GeneralI |  Defines parameters for Double T structural sections.
GeneralC |  Defines parameters for Channel Cold Formed structural sections.
GeneralU |  Defines parameters for Channel structural sections.
GeneralLA |  Defines parameters for Angle Cold Formed structural sections.
GeneralW |  Defines parameters for Angle structural sections.
GeneralT |  Defines parameters for Tees structural sections.
GeneralH |  Defines parameters for Rectangular Pipe structural sections.
GeneralS |  Defines parameters for Round Bar structural sections.
GeneralR |  Defines parameters for Pipe structural sections.
GeneralF |  Defines parameters for Flat Bar structural sections.
GeneralCEx |  Defines parameters for Channel With Fold Cold Formed structural sections.
GeneralLZ |  Defines parameters for Z Cold Formed structural sections.
See Also
Autodesk.Revit.DB.Structure.StructuralSections Namespace